// 数据结构:创,增,删,改,查
/*
线性表
└── 顺序表
    └── 数组
        ├── 基本概念
        │   └── 根据空间
        │       ├── 自动数组(栈区，全局):系统自动管理,默认1M大小
        │       └── 堆区数组：我们自己管理(malloc free/new delete)
        ├── 基本操作
        │   ├── 创建与初始化
        │   │   ├── 栈区：int a[10] = {1,2,3,4,5,6,7,8,9,0};
        │   │   └── 堆区：int *p = (int*)malloc(sizeof(int)*10); free(p);
        │   ├── 增
        │   │   ├── 尾巴上添加一个节点
        │   │   │   ├── 问题1：添加节点没空间了怎么办
        │   │   │   │   ├── 1、申请足够大的空间：除了数组，还要有两个参数分别记录数组容量和已使用的空间
        │   │   │   │   └── 2、动态申请空间
        │   │   │   │       ├── 选择：malloc
        │   │   │   │       └── 思路：申请个更大的，把前面的数据复制粘贴过去，新数据往后面加
        │   │   │   ├── 问题2：动态空间申请多大
        │   │   │   │   ├── 一次多申请一个？：有点儿耗时
        │   │   │   │   └── 一次多申请一些：用空间换时间
        │   │   │   ├── 思路
        │   │   │   │   ├── 问题1：有了空间，我们需要记录总共的元素数：容量
        │   │   │   │   ├── 问题2：数据存入不一定装满，所以得记录数据存在了哪个位置：大小/下标
        │   │   │   │   └── 问题3：记录首地址的指针
        │   │   │   └── 代码逻辑
        │   │   │       ├── 当容量与下标相等了，即装满了
        │   │   │       │   ├── 容量变大
        │   │   │       │   ├── 申请新空间
        │   │   │       │   ├── 将原数据赋值进新空间
        │   │   │       │   └── 释放原空间
        │   │   │       └── 装数据
        │   │   │           ├── 新数据加在尾巴上
        │   │   │           └── 下标++
        │   │   └── 中间增加一个节点
        │   │       ├── 将该节点后面的元素全往前挪动一个，把该数据覆盖
        │   │       └── 将最大下标减1
        │   ├── 删
        │   │   ├── 删除指定的
        │   │   └── 全删除：重置
        │   └── 改、查
        │       ├── 下标运算：[]
        │       └── 指针运算：*(p+n)
        ├── 特点
        │   ├── 随机读写速度快
        │   └── 增删比较慢
        ├── 代码转成C++
        └── 小例子
            ├── 打印四角落三角形
            └── 数组各种运算的宗旨：找下标的规律，找到规律就可以用循环解决
*/

//----------------------------------------------------------------------------------------------------
/*
创建与初始化
    ├── 栈区：int a[10] = {1,2,3,4,5,6,7,8,9,0};
    └── 堆区：int *p = (int*)malloc(sizeof(int)*10); free(p);
*/
#include<stdio.h>
#include<malloc.h>

int main() {
  int a[10] = {1,2,3,4,5,6,7};
  int* p = (int*)malloc(sizeof(int)*10);
  p[1] = 12;
  printf("%d\n",/*p[1]*/ *(p+1));

  free(p);
  return 0;
}