#include<iostream>
using namespace std;

/*****************************************************
拷贝构造/复制构造
1、也是一个构造函数，与其他构造函数构成重载的关系
2、同一个类的一个对象给另一个对象初始化时，调用拷贝构造
3、有默认形式的拷贝构造函数，同普通构造函数一起存在
-----------------------------------------------------
函数形式：
****************************************************/

class Test
{
public:
    Test(int a)
    {
        cout << "普通构造" << endl;
    }
    Test(const Test& t) //参数为当前类的常量引用类型
    {
        cout << "拷贝构造" << endl;
    }
    ~Test()
    {
        cout << "析构函数" << endl;
    }
};

int main(void)
{
    Test t1(56);
    Test t2(t1);
           
    cout << "-----------------------" << endl;
    // 临时对象 所在的生命周期：所在的语句
    Test(23);
    cout << "-----------------------" << endl;

    return 0;
}